# GetResourceVersionStatus Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalResourceReference..::..GetResourceVersionStatus Method
ExternalResourceReference Class See Also
---
Checks whether this ExternalResourceReference corresponds to the current version of the resource.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public ResourceVersionStatus GetResourceVersionStatus()
```

Visual Basic
---
```text
Public Function GetResourceVersionStatus As ResourceVersionStatus
```

Visual C++
---
```text
public:
ResourceVersionStatus GetResourceVersionStatus()
```

# ### Return Value
An enum indicating whether this reference represents the most recent version of the resource.
# Remarks
This method should only be called if the ExternalResourceServer that provides the resource is present.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | The server referenced by the ExternalResourceReference does not exist or does not implement IExternalResourceServer. |

# See Also
ExternalResourceReference Class
Autodesk.Revit.DB Namespace